Home work

Написать свой двусвязный список LinkedList.
Реализовать такие методы add(E e), set(E e), remove(E e), size();

Написать свою реализацию ArrayList
Реализовать такие методы add(E e), set(E e), remove(E e), size(), get(int index);

Условия принятия! Цена слова))
1. Если не написали ни единой строчки, 
даже просто не создали классы LemonLinkeList и LemonArrayList, по покупаете пицу на всех.
2. Если просто создали эти два класса, то покупка 2 литр NewCastle, 
или вложение эквивалентной суммы на финальную посиделку по окончанию курса.
3. Если выполнили предыдущие два пункта и хотя бы создали конструкторы, но не приступили к реализации методов, 
то 1кг фруктов(печенья/ништяки)
4. Если выполнили 3 предыдущих пункта и приступили к выполнению методов, 
хотя бы их создали без логики, не надо ничего делать
5. Проверка выполнения, сдержания слова будет проходить на следующем занятии 18.01 в первые 15 минут занятия.
6. Для тех кто присутсвовал сегодня(11.01) отсутсвие не является уважительной причиной для уклонения.

